{
  "name": "fast-agent-skills",
  "owner": {
    "name": "Fast Agent AI"
  },
  "metadata": {
    "description": "Official skills collection for fast-agent. Core tools for agent card development, deployment, and debugging.",
    "version": "1.1.0"
  },
  "plugins": [
    {
      "name": "agent-card-hooks",
      "source": "./skills/agent-card-hooks",
      "skills": "./",
      "description": "Guide for implementing fast-agent agent card tool hooks and lifecycle hooks. Use when you need to add hook functions to agent cards (tool_hooks, lifecycle_hooks, trim_tool_history) for tasks like compaction, saving history, modifying tool calls, or starting/shutting down external services."
    },
    {
      "name": "compaction-strategies",
      "source": "./skills/compaction-strategies",
      "skills": "./",
      "description": "Implement hook-based history compaction in fast-agent (rolling window, context threshold truncation, tool-result clearing, summary prompt compaction). Use when adding or extending compaction hooks and wiring them into agent cards."
    },
    {
      "name": "fast-agent-automation",
      "source": "./skills/fast-agent-automation",
      "skills": "./",
      "description": "Automate fast-agent runs from CLI, Docker, and Hugging Face Jobs. Use when users need repeatable non-interactive execution (fast-agent go --message / --prompt-file), deterministic artifact handling (--results), multi-model fan-out, containerization, or scheduled/cloud execution with hf jobs and secrets management."
    },
    {
      "name": "hf-space-deployer",
      "source": "./skills/hf-space-deployer",
      "skills": "./",
      "description": "Deploy fast-agent MCP Servers to Hugging Face Spaces using Docker. Use when the user wants to deploy an agent card as an MCP Server. Includes templates and CLI commands for deploying agent cards with custom tools to HF Spaces."
    },
    {
      "name": "lsp-project-setup",
      "source": "./skills/lsp-project-setup",
      "skills": "./",
      "description": "Create or update LSP-ready project scaffolds and agent-card guidance for Python or TypeScript repos. Use when configuring tool cards or agent cards to navigate a codebase with LSP (ty, typescript-language-server), including workspace roots, venvs, and minimal project config references."
    },
    {
      "name": "session-investigator",
      "source": "./skills/session-investigator",
      "skills": "./",
      "description": "Investigate fast-agent session and history files to diagnose issues. Use when a session ended unexpectedly, when debugging tool loops, when correlating sub-agent traces with main sessions, or when analyzing conversation flow and timing."
    }
  ]
}
